#Задача 2: Найдите сумму цифр трехзначного числа.
#
# *Пример:*
#
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 
#


n = int(input())
sum = n // 100 + n // 10 % 10 + n % 10
print(f"{sum} ( " + str(n // 100) + " + " + str(n // 10 % 10) + " + " + str(n % 10) + " )")